# 데이터 선택(loc)
이름을 이용하여 워하는 row에서 원하는 col 서택

In [3]:
import pandas as pd

In [4]:
df = pd.read_excel('student.xlsx', index_col='학번')
df

     이름    학교  국어점수   수학점수  평균  취미
학번
1번  김자바  자바학교     70    90  80   운동
2번  이자바  자바학교     80    80  80   독서
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

In [7]:
df.loc['1번'] #index가 1번인 전체 컬럼 값
df.loc['5번'] #index가 5번인 전체 컬럼 값

이름        정캐드
학교       캐드학교
국어점수       80
수학점수       80
평균         80
취미        NaN
Name: 5번, dtype: object

In [13]:
df.loc['1번', '수학점수'] # index가 1번인 학생의 수학점수
df.loc[['1번', '2번'], '이름']
df.loc[['1번', '2번'], ['이름', '평균']]

     이름  평균
학번
1번  김자바  80
2번  이자바  80

In [14]:
df.loc['1번':'3번', '이름':'수학점수'] #이 슬라이딩은 마지막도 포함 함

     이름    학교  국어점수   수학점수
학번
1번  김자바  자바학교     70    90
2번  이자바  자바학교     80    80
3번  박자바  자바학교     90   100

## 데이터 선택(iloc)
위치를 이용하여 워하는 row에서 원하는 col 서택

In [15]:
df.iloc[0]   #0번째 행의 데이터를 가져 옴

이름        김자바
학교       자바학교
국어점수       70
수학점수       90
평균         80
취미         운동
Name: 1번, dtype: object

In [16]:
df.iloc[0:3]

     이름    학교  국어점수   수학점수  평균 취미
학번
1번  김자바  자바학교     70    90  80  운동
2번  이자바  자바학교     80    80  80  독서
3번  박자바  자바학교     90   100  95  등산

In [18]:
df.iloc[0, 1] #0번째 행의 1번 컬럼 값

'자바학교'

In [19]:
df.iloc[[0,1], 3]

학번
1번    90
2번    80
Name: 수학점수, dtype: int64

In [20]:
df.iloc[[0,1], [3,4]]

    수학점수  평균
학번
1번    90  80
2번    80  80

In [21]:
df.iloc[0:3, 0:3]

     이름    학교  국어점수
학번
1번  김자바  자바학교     70
2번  이자바  자바학교     80
3번  박자바  자바학교     90